validation/T3A/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    above
    {
        type            patch;
        nFaces          47;
        startFace       53213;
    }
    top
    {
        type            patch;
        nFaces          327;
        startFace       53260;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       53587;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       53647;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          340;
        startFace       53727;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          53640;
        startFace       54067;
    }
)

// ************************************************************************* //
